espressif/esp-azure/azure-iot-sdk-c/umqtt/deps/c-utility/tests/tlsio_esp8266_ut/tlsio_esp8266_ut.c
// Copyright (c) Microsoft. All rights reserved.
// Licensed under the MIT license. See LICENSE file in the project root for full license information.

#ifdef WIN32
#define WIN32_LEAN_AND_MEAN
#endif

#include <stdlib.h>
#include <stdio.h>
#ifdef _CRTDBG_MAP_ALLOC
#include <crtdbg.h>
#endif

/**
 * Include the C standards here.
 */
#include <stddef.h>
#include <time.h>

/**
 * Include the test tools.
 */
#include "azure_macro_utils/macro_utils.h"
#include "testrunnerswitcher.h"
#include "umock_c/umock_c.h"
#include "umock_c/umocktypes_charptr.h"
#include "umock_c/umock_c_negative_tests.h"

/**
 * Include the mockable headers here.
 */
#define ENABLE_MOCKS
#include "../../adapters/esp8266_mock.h"
#undef ENABLE_MOCKS

/**
 * Include the target header after the ENABLE_MOCKS session.
 */
#include "azure_c_shared_utility/xio.h"
#include "azure_c_shared_utility/tlsio.h"

#define TEST_CREATE_CONNECTION_HOST_NAME (const char*)"https://test.azure-devices.net"
#define TEST_CREATE_CONNECTION_PORT (int)443

static const TLSIO_CONFIG tlsio_config = { TEST_CREATE_CONNECTION_HOST_NAME, TEST_CREATE_CONNECTION_PORT, NULL, NULL };

static int g_ssl_write_success = 1;
static int g_ssl_read_returns_data = 1;
static size_t g_on_bytes_received_buffer_size = 0;

static int g_gethostbyname_success = 1;
static int g_socket_success = 1;
static int g_setsockopt_success = 1;
static int g_bind_success = 1;
static int g_getsockopt_success = 1;
static int g_connect_success = 1;
static int g_ssl_lwip_select_success = 1;
static int g_ssl_ctx_new_success = 1;
static int g_ssl_new_success = 1;
static int g_ssl_set_fd_success = 1;
static int g_ssl_connect_success = 1;
static int g_ssl_shutdown_success = 1;
static int g_ssl_TLSv1clientmethod_success = 1;
static int g_ssl_fd_isset = 0;
static int g_ssl_get_error_success = 1;
static int g_socket_close_success = 1;
static SSL_CTX* g_ctx = NULL;
static SSL* g_ssl = NULL;
static SSL_METHOD* g_sslmethod = NULL;
static void* g_mallocptr = NULL;
static char* g_destination = NULL;

#define MAX_RETRY 20
#define RECEIVE_BUFFER_SIZE 1024

void* my_gballoc_malloc(size_t size)
{
    g_mallocptr = malloc(size);
    return g_mallocptr;
}

void* my_gballoc_realloc(void* ptr, size_t size)
{
    return realloc(ptr, size);
}

void my_gballoc_free(void* ptr)
{
    free(ptr);
}

typedef enum TLSIO_STATE_TAG
{
    TLSIO_STATE_NOT_OPEN,
    TLSIO_STATE_OPENING,
    TLSIO_STATE_OPEN,
    TLSIO_STATE_CLOSING,
    TLSIO_STATE_ERROR
} TLSIO_STATE;

typedef struct TLS_IO_INSTANCE_TAG
{
    ON_BYTES_RECEIVED on_bytes_received;
    ON_IO_OPEN_COMPLETE on_io_open_complete;
    ON_IO_CLOSE_COMPLETE on_io_close_complete;
    ON_IO_ERROR on_io_error;
    void* on_bytes_received_context;
    void* on_io_open_complete_context;
    void* on_io_close_complete_context;
    void* on_io_error_context;
    SSL* ssl;
    SSL_CTX* ssl_context;
    TLSIO_STATE tlsio_state;
    char* hostname;
    int port;
    char* certificate;
    const char* x509certificate;
    const char* x509privatekey;
    int sock;
    ip_addr_t target_ip;
} TLS_IO_INSTANCE;

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */
    const IO_INTERFACE_DESCRIPTION* tlsio_openssl_get_interface_description(void);

#ifdef __cplusplus
}
#endif /* __cplusplus */

int my_mallocAndStrcpy_s(char** destination, const char* source){
    (void)(source);
    *destination = (char*)malloc(1);
    g_destination = *destination;
    return 0;
}
int my_SSL_get_error(const SSL *ssl, int ret_code){
    (void)(ret_code), (void)(ssl);
    if (g_ssl_get_error_success == 1){
        return SSL_ERROR_WANT_READ;
    }else{
        return 0;
    }

}
int my_FD_ISSET(int n, void* p){
    (void)(n),(void)(p);
    if(g_ssl_fd_isset == 0){
        g_ssl_fd_isset++;
        return 1;
    }else{
        return 0;
    }
}

int my_lwip_select(int maxfdp1, fd_set *readset, fd_set *writeset, fd_set *exceptset,
               struct timeval *timeout){
    (void)(maxfdp1),(void)(readset),(void)(writeset),(void)(exceptset),(void)(timeout);

    if(g_ssl_lwip_select_success == 1)
    {
        return 1;
    }else{
        return 0;
    }
}

int my_SSL_write(SSL *ssl, const void *buffer, int len){
    (void)(ssl),(void)(buffer);

    if (g_ssl_write_success){
        return len;
    }else{
        return 0;
    }
}

void my_SSL_CTX_free(SSL_CTX *ctx){
    (void)(ctx);
}

void my_SSL_free(SSL *ssl){
    (void)(ssl);
}

int my_SSL_read(SSL *ssl, void *buffer, int len){
    (void)(ssl),(void)(buffer);
    if (g_ssl_read_returns_data){
        return len;
    }else{
        return 0;
    }
}

int my_SSL_connect(SSL *ssl){
    (void)(ssl);
    if (g_ssl_connect_success == 1){
        return 1;
    }else{
        return -1;
    }
}

int my_SSL_shutdown(SSL *ssl){
    (void)(ssl);
    if (g_ssl_shutdown_success == 1){
        return 0;
    }else{
        return -1;
    }
}

int my_socket(int domain, int type, int protocol){
    (void)(domain),(void)(type), (void)(protocol);
    if (g_socket_success == 1){
        return 0;
    }else{
        return -1;
    }
}

int my_SSL_set_fd(SSL *ssl, int fd){
    (void)(ssl),(void)(fd);
    if (g_ssl_set_fd_success == 1){
        return 1;
    }else{
        return 0;
    }
}
//NOTE: malloc(1) is used here since SSL is defined as void in esp8266_mock.h
SSL* my_SSL_new(SSL_CTX *ssl_ctx){
    (void)(ssl_ctx);
    if (g_ssl_new_success == 1){
         g_ssl = (SSL*)malloc(1);
        return g_ssl;
    }else{
        return NULL;
    }
}

//NOTE: malloc(1) is used here since SSL_CTX is defined as void in esp8266_mock.h
SSL_CTX* my_SSL_CTX_new(SSL_METHOD *method){
    (void)(method);
    if(g_ssl_ctx_new_success == 1)
    {
        if(method != NULL){
            g_ctx = (SSL_CTX*)malloc(1);
            return g_ctx;
        }
        else
        {
            return NULL;
        }
    }else{
        return NULL;
    }
}

void my_SSL_CTX_set_default_read_buffer_len(SSL_CTX *ctx, size_t len)
{
    (void)(ctx),(void)(len);

}

int my_fcntl(int s, int cmd, int val)
{
    (void)(s);
    (void)(cmd);
    (void)(val);
    return 0;
}
err_t my_netconn_gethostbyname(const char *name, ip_addr_t *target_ip){
    (void)(name),(void)(target_ip);
    if (g_gethostbyname_success == 1){
        return 0;
    }else{
        return -1;
    }
}

