espressif/esp-azure/azure-iot-sdk-c/umqtt/deps/c-utility/tests/tlsio_esp8266_ut/tlsio_esp8266_ut.c
//NOTE: malloc(1) is used here since SSL_METHOD is defined as void in esp8266_mock.h
SSL_METHOD* my_TLSv1_client_method(void){
    if (g_ssl_TLSv1clientmethod_success == 1){
        g_sslmethod = (SSL_METHOD*)malloc(1);
        return g_sslmethod;
    }else{
        return NULL;
    }
}

int my_bind(int s, const struct sockaddr* name, socklen_t namelen){
    (void)(s),(void)(name),(void)(namelen);
    if (g_bind_success == 1){
        return 0;
    }else{
        return -1;
    }
}

int my_setsockopt(int s, int level, int optname, const void *optval, socklen_t optlen){
    (void)(s),(void)(level),(void)(optname),(void)(optval),(void)(optlen);
    if (g_setsockopt_success == 1){
        return 0;
    }else{
        return -1;
    }
}

int my_close(int s){
    (void)(s);
    if (g_socket_close_success == 1){
        return 0;
    } else{
        return 1;
    }
}

int my_connect(int s, const struct sockaddr *name, socklen_t namelen){
    (void)(s),(void)(name), (void)(namelen);
    if (g_connect_success == 1){
        return 0;
    }else{
        return -1;
    }
}
#undef   EINPROGRESS
#define  EINPROGRESS    115  /* Operation now in progress */
int my_getsockopt(int s, int level, int optname, void *optval, socklen_t *optlen){
    (void)(s), (void)(level), (void)(optname), (void)(optval), (void)(optlen);
    if (g_getsockopt_success == 1){
        return EINPROGRESS;
    }else{
        return -1;
    }
}

void my_os_delay_us(int us){
    (void)(us);
}

static void on_bytes_received(void* context, const unsigned char* buffer, size_t size)
{
    (void)(context), (void)(buffer), (void)(size);
    g_on_bytes_received_buffer_size = size;
}

#define ENABLE_MOCKS
#include "azure_c_shared_utility/gballoc.h"
#include "azure_c_shared_utility/crt_abstractions.h"
#include "azure_c_shared_utility/optionhandler.h"

IMPLEMENT_UMOCK_C_ENUM_TYPE(IO_OPEN_RESULT, IO_OPEN_RESULT_VALUES);
IMPLEMENT_UMOCK_C_ENUM_TYPE(IO_SEND_RESULT, IO_SEND_RESULT_VALUES);


MOCK_FUNCTION_WITH_CODE(, void, test_on_io_error, void*, context)
MOCK_FUNCTION_END();
MOCK_FUNCTION_WITH_CODE(, void, test_on_bytes_received, void*, context, const unsigned char*, buffer, size_t, size)
MOCK_FUNCTION_END();
MOCK_FUNCTION_WITH_CODE(, void, test_on_io_open_complete, void*, context, IO_OPEN_RESULT, open_result)
MOCK_FUNCTION_END();
MOCK_FUNCTION_WITH_CODE(, void, test_on_io_close_complete, void*, context)
MOCK_FUNCTION_END();
MOCK_FUNCTION_WITH_CODE(, void, test_on_send_complete, void*, context, IO_SEND_RESULT, send_result)
MOCK_FUNCTION_END();
#undef ENABLE_MOCKS

 /**
  * You can create some global variables that your test will need in some way.
  */
static void* g_GenericPointer;

/**
  * Umock error will helps you to identify errors in the test suite or in the way that you are
  *    using it, just keep it as is.
  */
MU_DEFINE_ENUM_STRINGS(UMOCK_C_ERROR_CODE, UMOCK_C_ERROR_CODE_VALUES)

static void on_umock_c_error(UMOCK_C_ERROR_CODE error_code)
{
    ASSERT_FAIL("umock_c reported error :%" PRI_MU_ENUM "", MU_ENUM_VALUE(UMOCK_C_ERROR_CODE, error_code));
}

/**
 * This is necessary for the test suite, just keep as is.
 */
static TEST_MUTEX_HANDLE g_testByTest;

/**
 * Tests begin here.
 *
 *   RUN_TEST_SUITE(tlsio_esp8266_ut, failedTestCount);
 *
 */
BEGIN_TEST_SUITE(tlsio_esp8266_ut)

    /**
     * This is the place where we initialize the test system. Replace the test name to associate the test
     *   suite with your test cases.
     * It is called once, before start the tests.
     */
    TEST_SUITE_INITIALIZE(a)
    {
        int result;
        g_testByTest = TEST_MUTEX_CREATE();
        ASSERT_IS_NOT_NULL(g_testByTest);

        (void)umock_c_init(on_umock_c_error);

        result = umocktypes_charptr_register_types();
        ASSERT_ARE_EQUAL(int, 0, result);

        /**
         * It is necessary to identify the types defined on your target. With it, the test system will
         *    know how to use it.
         *
         * On the target.h example, there is the type TARGET_HANDLE that is a void*
         */
        //REGISTER_UMOCK_ALIAS_TYPE(CALLEE_HANDLE, void*);


        /**
         * Or you can combine, for example, in the success case malloc will call my_gballoc_malloc, and for
         *    the failed cases, it will return NULL.
         */
        REGISTER_GLOBAL_MOCK_HOOK(gballoc_malloc, my_gballoc_malloc);
        REGISTER_GLOBAL_MOCK_FAIL_RETURN(gballoc_malloc, NULL);
        REGISTER_GLOBAL_MOCK_HOOK(gballoc_realloc, my_gballoc_realloc);
        REGISTER_GLOBAL_MOCK_FAIL_RETURN(gballoc_realloc, NULL);
        REGISTER_GLOBAL_MOCK_HOOK(gballoc_free, my_gballoc_free);


        //REGISTER_GLOBAL_MOCK_HOOK(OptionHandler_Create, my_OptionHandler_Create);
        REGISTER_GLOBAL_MOCK_HOOK(mallocAndStrcpy_s, my_mallocAndStrcpy_s);
        REGISTER_GLOBAL_MOCK_HOOK(lwip_select, my_lwip_select);
        REGISTER_GLOBAL_MOCK_HOOK(SSL_write, my_SSL_write);
        REGISTER_GLOBAL_MOCK_HOOK(SSL_CTX_free, my_SSL_CTX_free);
        REGISTER_GLOBAL_MOCK_HOOK(SSL_free, my_SSL_free);
        REGISTER_GLOBAL_MOCK_HOOK(SSL_read, my_SSL_read);
        REGISTER_GLOBAL_MOCK_HOOK(SSL_connect, my_SSL_connect);
        REGISTER_GLOBAL_MOCK_HOOK(SSL_shutdown, my_SSL_shutdown);
        REGISTER_GLOBAL_MOCK_HOOK(SSL_set_fd, my_SSL_set_fd);
        REGISTER_GLOBAL_MOCK_HOOK(SSL_new, my_SSL_new);
        REGISTER_GLOBAL_MOCK_HOOK(SSL_CTX_new, my_SSL_CTX_new);
        REGISTER_GLOBAL_MOCK_HOOK(netconn_gethostbyname, my_netconn_gethostbyname);
        REGISTER_GLOBAL_MOCK_HOOK(TLSv1_client_method, my_TLSv1_client_method);
        REGISTER_GLOBAL_MOCK_HOOK(bind, my_bind);
        REGISTER_GLOBAL_MOCK_HOOK(getsockopt, my_getsockopt);
        REGISTER_GLOBAL_MOCK_HOOK(socket, my_socket);
        REGISTER_GLOBAL_MOCK_HOOK(SSL_CTX_set_default_read_buffer_len, my_SSL_CTX_set_default_read_buffer_len);
        REGISTER_GLOBAL_MOCK_HOOK(setsockopt, my_setsockopt);
        REGISTER_GLOBAL_MOCK_HOOK(close, my_close);
        REGISTER_GLOBAL_MOCK_HOOK(connect, my_connect);
        REGISTER_GLOBAL_MOCK_HOOK(FD_ISSET, my_FD_ISSET);
        REGISTER_GLOBAL_MOCK_HOOK(SSL_get_error, my_SSL_get_error);
        REGISTER_GLOBAL_MOCK_HOOK(fcntl, my_fcntl);
        REGISTER_TYPE(IO_SEND_RESULT, IO_SEND_RESULT);
        REGISTER_TYPE(IO_OPEN_RESULT, IO_OPEN_RESULT);

        /**
         * You can initialize other global variables here, for instance image that you have a standard void* that will be converted
         *   any pointer that your test needs.
         */
        g_GenericPointer = malloc(1);
        ASSERT_IS_NOT_NULL(g_GenericPointer);
    }

    /**
     * The test suite will call this function to cleanup your machine.
     * It is called only once, after all tests is done.
     */
    TEST_SUITE_CLEANUP(TestClassCleanup)
    {
        free(g_GenericPointer);

        umock_c_deinit();

