espressif/esp-azure/azure-iot-sdk-c/umqtt/deps/c-utility/tests/tlsio_esp8266_ut/tlsio_esp8266_ut.c
        ///cleanup
    }

    /* Tests_SRS_TLSIO_SSL_ESP8266_99_061: [ If the buffer is NULL, the tlsio_openssl_send shall not do anything, and return _LINE_. ] */
    TEST_FUNCTION(tlsio_openssl_send__SSL_write_null_buffer__failed)
    {
        ///arrange
        int result = 0;
        TLS_IO_INSTANCE instance;
        const IO_INTERFACE_DESCRIPTION* tlsioInterfaces;
        memset(&instance, 0, sizeof(TLS_IO_INSTANCE));
        instance.tlsio_state = TLSIO_STATE_OPEN;
        g_ssl_write_success = 1;

        tlsioInterfaces = tlsio_openssl_get_interface_description();
        ASSERT_IS_NOT_NULL(tlsioInterfaces);

        ///act
        result = tlsioInterfaces->concrete_io_send(&instance, NULL, 0, test_on_send_complete, (void*)0x4242);

        ///assert
        ASSERT_ARE_NOT_EQUAL(int, result, 0);
        ///cleanup
     }

    /* Tests_SRS_TLSIO_SSL_ESP8266_99_062: [ If the size is 0, the tlsio_openssl_send shall not do anything, and return _LINE_. ] */
    TEST_FUNCTION(tlsio_openssl_send__SSL_write_size_zero__failed)
    {
        ///arrange
        int result = 0;
        TLS_IO_INSTANCE instance;
        const IO_INTERFACE_DESCRIPTION* tlsioInterfaces;
        unsigned char test_buffer[] = {0x42};
        memset(&instance, 0, sizeof(TLS_IO_INSTANCE));
        instance.tlsio_state = TLSIO_STATE_OPEN;
        g_ssl_write_success = 1;

        tlsioInterfaces = tlsio_openssl_get_interface_description();
        ASSERT_IS_NOT_NULL(tlsioInterfaces);

        ///act
        result = tlsioInterfaces->concrete_io_send(&instance, test_buffer, 0, test_on_send_complete, (void*)0x4242);

        ///assert
        ASSERT_ARE_NOT_EQUAL(int, result, 0);
        ///cleanup
     }

    /* Tests_SRS_TLSIO_SSL_ESP8266_99_059: [ If the tlsio state is not TLSIO_STATE_OPEN, the tlsio_openssl_send shall return _LINE_. ] */
    TEST_FUNCTION(tlsio_openssl_send_wrong_state__failed)
    {
        ///arrange
        int result;
        TLS_IO_INSTANCE instance;
        const IO_INTERFACE_DESCRIPTION* tlsioInterfaces = tlsio_openssl_get_interface_description();
        ASSERT_IS_NOT_NULL(tlsioInterfaces);

        memset(&instance, 0, sizeof(TLS_IO_INSTANCE));
        instance.tlsio_state = TLSIO_STATE_NOT_OPEN;
        ///act
        result = tlsioInterfaces->concrete_io_send(&instance, NULL, 0,  NULL, NULL);

        ///assert
        ASSERT_ARE_NOT_EQUAL(int, 0, result);

        ///cleanup
    }

    /* Tests_SRS_TLSIO_SSL_ESP8266_99_057: [ If the ssl was not able to send all the bytes in the buffer, the tlsio_openssl_send shall call the on_send_complete with IO_SEND_ERROR, and return _LINE_. ] */
    TEST_FUNCTION(tlsio_openssl_send__SSL_write__failed)
    {
        ///arrange
        int result = 0;
        TLS_IO_INSTANCE instance;
        unsigned char test_buffer[] = { 0x42, 0x43 };
        const IO_INTERFACE_DESCRIPTION* tlsioInterfaces;
        memset(&instance, 0, sizeof(TLS_IO_INSTANCE));
        instance.tlsio_state = TLSIO_STATE_OPEN;
        g_ssl_write_success = 0;

        tlsioInterfaces = tlsio_openssl_get_interface_description();
        ASSERT_IS_NOT_NULL(tlsioInterfaces);

        umock_c_reset_all_calls();
        STRICT_EXPECTED_CALL(lwip_select(IGNORED_NUM_ARG, IGNORED_PTR_ARG,
              IGNORED_PTR_ARG, IGNORED_PTR_ARG, IGNORED_PTR_ARG)).IgnoreArgument(1).IgnoreArgument(2).IgnoreArgument(3).IgnoreArgument(4).IgnoreArgument(5);
        STRICT_EXPECTED_CALL(FD_ISSET(IGNORED_NUM_ARG,IGNORED_PTR_ARG)).IgnoreArgument(1).IgnoreArgument(2);
        EXPECTED_CALL(SSL_write(IGNORED_PTR_ARG,IGNORED_PTR_ARG,IGNORED_NUM_ARG));
        EXPECTED_CALL(SSL_shutdown(IGNORED_PTR_ARG));

        STRICT_EXPECTED_CALL(test_on_send_complete((void*)0x4242, IO_SEND_ERROR));

        ///act
        result = tlsioInterfaces->concrete_io_send(&instance, test_buffer, sizeof(test_buffer), test_on_send_complete, (void*)0x4242);

        ///assert
        ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
        ASSERT_ARE_NOT_EQUAL(int, result, 0);
        ///cleanup
    }

    /* Tests_SRS_TLSIO_SSL_ESP8266_99_043: [ The tlsio_openssl_close shall start the process to close the ssl connection. ] */
    /* Tests_SRS_TLSIO_SSL_ESP8266_99_045: [ The tlsio_openssl_close shall store the provided on_io_close_complete callback function address. ] */
    /* Tests_SRS_TLSIO_SSL_ESP8266_99_046: [ The tlsio_openssl_close shall store the provided on_io_close_complete_context handle. ] */
    /* Tests_SRS_TLSIO_SSL_ESP8266_99_047: [ If tlsio_openssl_close get success to start the process to close the ssl connection, it shall set the tlsio state as TLSIO_STATE_CLOSING, and return 0. ] */
    /* Tests_SRS_TLSIO_SSL_ESP8266_99_050: [ If tlsio_openssl_close successfully destroys the ssl connection, it shall set the tlsio state as TLSIO_STATE_NOT_OPEN, and return 0. ] */
    /* Tests_SRS_TLSIO_SSL_ESP8266_99_051: [ If tlsio_openssl_close successfully destroys the ssl connection, it shall call on_io_close_complete. ] */
    TEST_FUNCTION(tlsio_openssl_close__succeed)
    {
        ///arrange
        int result;
        TLS_IO_INSTANCE instance;
        SSL_CTX *ctx;
        SSL *ssl;
        const IO_INTERFACE_DESCRIPTION* tlsioInterfaces;
        memset(&instance, 0, sizeof(TLS_IO_INSTANCE));
        g_ssl_TLSv1clientmethod_success = 0;
        ctx = SSL_CTX_new(TLSv1_client_method());
        ASSERT_IS_NULL(ctx);
        g_ssl_TLSv1clientmethod_success = 1;
        ctx = SSL_CTX_new(TLSv1_client_method());
        ASSERT_IS_NOT_NULL(ctx);
        ssl = SSL_new(ctx);
        g_ssl_shutdown_success = 1;
        g_socket_close_success = 1;

        instance.tlsio_state = TLSIO_STATE_OPEN;
        instance.ssl = ssl;
        instance.ssl_context = ctx;

        tlsioInterfaces = tlsio_openssl_get_interface_description();
        ASSERT_IS_NOT_NULL(tlsioInterfaces);

        umock_c_reset_all_calls();
        STRICT_EXPECTED_CALL(SSL_free(IGNORED_PTR_ARG)).IgnoreArgument(1);
        STRICT_EXPECTED_CALL(close(IGNORED_NUM_ARG)).IgnoreArgument(1);
        STRICT_EXPECTED_CALL(SSL_CTX_free(IGNORED_PTR_ARG)).IgnoreArgument(1);
        STRICT_EXPECTED_CALL(test_on_io_close_complete((void*)0x4242));
        ///act
        result = tlsioInterfaces->concrete_io_close(&instance, test_on_io_close_complete, (void*)0x4242);

        ///assert
        ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
        ASSERT_ARE_EQUAL(int, 0, result);
        ASSERT_ARE_EQUAL(int, (int)TLSIO_STATE_NOT_OPEN, instance.tlsio_state);
        ///cleanup
        if(g_ctx != NULL){
            free(g_ctx);
        }
        if(g_ssl != NULL){
            free(g_ssl);
        }
        if (g_sslmethod != NULL){
            free(g_sslmethod);
        }
    }


    /* Tests_SRS_TLSIO_SSL_ESP8266_99_048: [ If the tlsio state is TLSIO_STATE_NOT_OPEN, TLSIO_STATE_OPENING, or TLSIO_STATE_CLOSING, the tlsio_openssl_close shall set the tlsio state as TLSIO_STATE_ERROR, and return _LINE_. ] */
    TEST_FUNCTION(tlsio_openssl_close_wrong_state__failed)
    {
        ///arrange
        int result;
        const IO_INTERFACE_DESCRIPTION* tlsioInterfaces = tlsio_openssl_get_interface_description();
        TLS_IO_INSTANCE instance;
        ASSERT_IS_NOT_NULL(tlsioInterfaces);

        memset(&instance, 0, sizeof(TLS_IO_INSTANCE));
        instance.tlsio_state = TLSIO_STATE_NOT_OPEN;
        ///act
        result = tlsioInterfaces->concrete_io_close(&instance, test_on_io_close_complete, (void*)0x4242);

        ///assert
        ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
        ASSERT_ARE_NOT_EQUAL(int, 0, result);

