espressif/esp-azure/azure-iot-sdk-c/umqtt/deps/c-utility/tests/tlsio_esp8266_ut/tlsio_esp8266_ut.c
        ///cleanup
        if(g_ctx != NULL){
            free(g_ctx);
        }
        if (g_ssl != NULL){
            free(g_ssl);
        }
        if (g_sslmethod != NULL){
            free(g_sslmethod);
        }
    }

    /* TESTS_SRS_TLSIO_SSL_ESP8266_99_012: [ If there is not enough memory to create the tlsio, the tlsio_openssl_create shall return NULL as the handle. ] */
    TEST_FUNCTION(tlsio_openssl_create_malloc__failed)
    {
        ///arrange
        OPTIONHANDLER_HANDLE result;
        const IO_INTERFACE_DESCRIPTION* tlsioInterfaces;
        int negativeTestsInitResult = umock_c_negative_tests_init();
        size_t i;

        ASSERT_ARE_EQUAL(int, 0, negativeTestsInitResult);

        tlsioInterfaces = tlsio_openssl_get_interface_description();
        ASSERT_IS_NOT_NULL(tlsioInterfaces);

        umock_c_reset_all_calls();

        STRICT_EXPECTED_CALL(gballoc_malloc(IGNORED_NUM_ARG)).IgnoreArgument(1);

        umock_c_negative_tests_snapshot();

        for (i = 0; i < umock_c_negative_tests_call_count(); i++)
        {
            umock_c_negative_tests_reset();
            umock_c_negative_tests_fail_call(i);
            ///act
            result = (OPTIONHANDLER_HANDLE)tlsioInterfaces->concrete_io_create((void*)&tlsio_config);

            ///assert
            ASSERT_IS_NULL(result);
        }

        ///cleanup
        umock_c_negative_tests_deinit();
    }


    /* TESTS_SRS_TLSIO_SSL_ESP8266_99_009: [ The tlsio_openssl_create shall create a new instance of the tlsio for esp8266. ] */
    /* TESTS_SRS_TLSIO_SSL_ESP8266_99_010: [ The tlsio_openssl_create shall return a non-NULL handle on success. ] */
    /* TESTS_SRS_TLSIO_SSL_ESP8266_99_011: [ The tlsio_openssl_create shall allocate memory to control the tlsio instance. ] */
    /* TESTS_SRS_TLSIO_SSL_ESP8266_99_016: [ The tlsio_openssl_create shall initialize all callback pointers as NULL. ] */
    /* TESTS_SRS_TLSIO_SSL_ESP8266_99_017: [ The tlsio_openssl_create shall receive the connection configuration (TLSIO_CONFIG). ] */
    /* TESTS_SRS_TLSIO_SSL_ESP8266_99_020: [ If tlsio_openssl_create get success to create the tlsio instance, it shall set the tlsio state as TLSIO_STATE_NOT_OPEN. ] */
    TEST_FUNCTION(tlsio_openssl_create__succeed)
    {
        TLS_IO_INSTANCE* result;
        const IO_INTERFACE_DESCRIPTION* tlsioInterfaces = tlsio_openssl_get_interface_description();
        ASSERT_IS_NOT_NULL(tlsioInterfaces);

        umock_c_reset_all_calls();

        STRICT_EXPECTED_CALL(gballoc_malloc(sizeof(TLS_IO_INSTANCE)));
        STRICT_EXPECTED_CALL(mallocAndStrcpy_s(&g_destination, IGNORED_PTR_ARG)).IgnoreArgument(1).IgnoreArgument(2);

        ///act
        result = (TLS_IO_INSTANCE*)tlsioInterfaces->concrete_io_create((void*)&tlsio_config);

        ///assert
        ASSERT_IS_NOT_NULL(result);
        ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
        ASSERT_ARE_EQUAL(int, (int)TLSIO_STATE_NOT_OPEN, result->tlsio_state);
        ///cleanup
        if (g_mallocptr != NULL){
            free(g_mallocptr);
        }
        if (g_destination != NULL){
            free(g_destination);
        }
    }


    /* TESTS_SRS_TLSIO_SSL_ESP8266_99_013: [ The tlsio_openssl_create shall return NULL when io_create_parameters is NULL. ] */
    TEST_FUNCTION(tlsio_openssl_create_NULL_parameters__failed)
    {
        ///arrange
        OPTIONHANDLER_HANDLE result;
        const IO_INTERFACE_DESCRIPTION* tlsioInterfaces = tlsio_openssl_get_interface_description();
        ASSERT_IS_NOT_NULL(tlsioInterfaces);

        ///act
        result = (OPTIONHANDLER_HANDLE)tlsioInterfaces->concrete_io_create(NULL);

        ///assert
        ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
        ASSERT_IS_NULL(result);

        ///cleanup
    }


    /* Tests_SRS_TLSIO_SSL_ESP8266_99_078: [ The tlsio_openssl_retrieveoptions shall not do anything, and return NULL. ]*/
    TEST_FUNCTION(tlsio_openssl_retrieveoptions__succeed)
    {
        ///arrange
        OPTIONHANDLER_HANDLE result;
        const IO_INTERFACE_DESCRIPTION* tlsioInterfaces = tlsio_openssl_get_interface_description();
        ASSERT_IS_NOT_NULL(tlsioInterfaces);

        umock_c_reset_all_calls();

        ///act
        result = tlsioInterfaces->concrete_io_retrieveoptions(NULL);

        ///assert
        ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
        ASSERT_IS_NULL(result);

        ///cleanup
    }

    /* Tests_SRS_TLSIO_SSL_ESP8266_99_077: [ he tlsio_openssl_setoption shall not do anything, and return 0. ]*/
    TEST_FUNCTION(tlsio_openssl_setoption__succeed)
    {
        ///arrange
        int result;
        const IO_INTERFACE_DESCRIPTION* tlsioInterfaces = tlsio_openssl_get_interface_description();
        ASSERT_IS_NOT_NULL(tlsioInterfaces);

        umock_c_reset_all_calls();

        ///act
        result = tlsioInterfaces->concrete_io_setoption(NULL, NULL, NULL);

        ///assert
        ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
        ASSERT_ARE_EQUAL(int, 0, result);

        ///cleanup
    }

    /* Tests_SRS_TLSIO_SSL_ESP8266_99_008: [ The tlsio_openssl_get_interface_description shall return the VTable IO_INTERFACE_DESCRIPTION. ]*/
    TEST_FUNCTION(tlsio_openssl_get_interface_description__succeed)
    {
        ///arrange
        const IO_INTERFACE_DESCRIPTION* tlsioInterfaces;

        ///act
        tlsioInterfaces = tlsio_openssl_get_interface_description();

        ///assert
        ASSERT_IS_NOT_NULL(tlsioInterfaces);

        ///cleanup
    }


END_TEST_SUITE(tlsio_esp8266_ut)